# 自定义类别
def fifteen_classes():
        return ['其他类别',
                '水田',
                '水浇地',
                '旱耕地',
                '园地',
                '乔木林地',
                '灌木林地',
                '天然草地',
                '人工草地',
                '工业用地',
                '城市住宅',
                '村镇住宅',
                '交通运输',
                '河流',
                '湖泊',
                '坑塘']

def twentythree_classes():
        return ['其它',
                '种植土地',
                '林地',
                '草地',
                '房屋建筑',
                '道路',
                '人工裸地',
                '自然裸地',
                '水域',
                '硬化地表',
                '船',
                '油罐',
                '棒球场',
                '网球场',
                '篮球场',
                '田径场',
                '桥梁',
                '车辆',
                '游泳池',
                '环岛',
                '足球场',
                '飞机',
                '温室大棚']

def five_classes():
        return ['其他类别',
                '建筑',
                '田地',
                '森林',
                '草地',
                '水体']
def one_classes():
        return ['其他类别',
                '建筑']